iptw_gformula.tex


\section{Single time point strategy}
\label{sec:org75a5ac0}
\subsection{Identifiability Conditions}
\label{sec:org6698a64}
\begin{itemize}
\item We will follow the terminologies in \cite{hernanCausalInference2019} (Chapter 3).
\item 1. \textbf{Consistency}: the values of treatment under comparison correspond to well-defined interventions that, in turn, correspond to the versions of treatment in the data
\end{itemize}
\begin{center}
\(Y_{i} = Y_{i}^{a_{0}}\) if \(A_{0i} = a_{0}\) for all \(a_{0}\)
\end{center}
\begin{itemize}
\item 2. \textbf{Exchangeability}: the conditional probability of receiving every value of treatment, though not decided by the investigators, depends only on the measured covariates
\end{itemize}
\begin{center}
\(A_{0} \ind Y^{a_{0}} | L_{0}\) for all \(a_{0}\)
\end{center}
\begin{itemize}
\item 3. \textbf{Positivity}: the conditional probability of receiving every value of treatment is greater than zero, i.e., positive
\end{itemize}
\begin{center}
\(f(A_{0} = a_{0} | L_{0} = l_{0}) > 0\) for all \(a_{0},l_{0}\) where \(f(L_{0} = l_{0}) > 0\)
\end{center}

\subsection{G-formula}
\label{sec:org068b635}
This follows the Technical Point 2.3 in \cite{hernanCausalInference2019}.
\begin{align*}
  &~~~\text{By iterative expectation}\\
  E[Y^{a_{0}}]
  &= E[E[Y^{a_{0}} | L_{0}]]\\
  &~~~\text{By conditional exchangeability: } Y^{a_{0}} \ind A_{0} | L_{0}\\
  &= E[E[Y^{a_{0}} | A_{0}, L_{0}]]\\
  &~~~\text{By exchangeability, }E[Y^{a_{0}} | A_{0}, L_{0}] = E[Y^{a_{0}} | A_{0} = a_{0}, L_{0}]\\
  &= E[E[Y^{a_{0}} | A_{0} = a_{0}, L_{0}]]\\
  &~~~\text{By consistency}\\
  &= E[E[Y | A_{0} = a_{0}, L_{0}]]\\
  &~~~\text{Make outer expectation explicit sum}\\
  &= \sum_{l_{0}} E[Y | A_{0} = a_{0}, L_{0} = l_{0}] f(L_{0} = l_{0})\\
  &= \text{Conditional mean averaged over $L_{0}$}\\
\end{align*}

\subsection{IPTW}
\label{sec:org42b4f3d}
This follows the Technical Point 2.3 in \cite{hernanCausalInference2019}.
\begin{align*}
  &~~~\text{By iterative expectation}\\
  E[Y^{a_{0}}]
  &= E[E[Y^{a_{0}} | L_{0}]]\\
  &~~~\text{Insert a carefully-crafted expression that is 1.}\\
  &= E \left[ \frac{f(A_{0}=a_{0} | L_{0})}{f(A_{0}=a_{0} | L_{0})} E[Y^{a_{0}} | L_{0}] \right]\\
  &~~~\text{Using probability = expectation of indicator}\\
  &= E \left[ \frac{E[I(A_{0}=a_{0}) | L_{0}]}{f(A_{0}=a_{0} | L_{0})} E[Y^{a_{0}} | L_{0}] \right]\\
  &~~~\text{Conditional exchangeability: } Y^{a_{0}} \ind A_{0} | L_{0}\\
  &~~~\text{This allows merging the two inner expectations.}\\
  &= E \left[ \frac{1}{f(A_{0}=a_{0} | L_{0})} E[I(A_{0}=a_{0})Y^{a_{0}} | L_{0}] \right]\\
  &~~~\text{By stability, } g(L_{0}) = E[g(L_{0}) | L_{0}].\\
  &~~~\text{i.e., a function of $L_{0}$ only (IPTW expression) can go into $E[\cdot | L_{0}]$}\\
  &= E \left[ E \left[ \frac{1}{f(A_{0}=a_{0} | L_{0})} I(A_{0}=a_{0})Y^{a_{0}} \bigg| L_{0} \right] \right]\\
  &~~~\text{Reversing iterative expectation (tower property)}\\
  &= E \left[ \frac{1}{f(A_{0}=a_{0} | L_{0})} I(A_{0}=a_{0})Y^{a_{0}} \right]\\
  &~~~\text{By consistency, }I(A_{0}=a_{0})Y^{a_{0}} = I(A_{0}=a_{0})Y = Y \text{ for } A_{0} = a_{0}.\\
  &~~~\text{Also, }I(A_{0}=a_{0})Y^{a_{0}} = 0 = I(A_{0}=a_{0})Y \text{ for } A_{0} \ne a_{0}.\\
  &~~~\text{Thus, }I(A_{0}=a_{0})Y^{a_{0}} = I(A_{0}=a_{0})Y \text{ regardless of } A_{0}.\\
  &= E \left[ \frac{1}{f(A_{0}=a_{0} | L_{0})} I(A_{0}=a_{0})Y \right]\\
  &= \text{IPTW mean of $Y$ for group $A_{0} = a_{0}$}\\
\end{align*}

\begin{itemize}
\item Law of Total Expectation (Iterative Expectation): \url{https://en.wikipedia.org/wiki/Law\_of\_total\_expectation}
\item Stability and Tower Property: \url{https://en.wikipedia.org/wiki/Conditional\_expectation\#Basic\_properties}
\item Indicator function: \url{https://www.statlect.com/fundamentals-of-probability/indicator-functions}
\item Expectation of product of random variables: \url{https://en.wikipedia.org/wiki/Product\_distribution\#Expectation\_of\_product\_of\_random\_variables}
\end{itemize}

\section{Multiple time point strategy}
\label{sec:orgdf55f13}
\subsection{Identifiability Conditions}
\label{sec:org310e42f}
\begin{itemize}
\item We will follow the terminologies in \cite{hernanCausalInference2019} (Chapter 19, Technical Point 19.2).
\item 1. \textbf{Consistency}: the values of treatment under comparison correspond to well-defined interventions that, in turn, correspond to the versions of treatment in the data
\end{itemize}
\begin{center}
\(Y_{i} = Y_{i}^{a_{0},a_{1}}\) if \(A_{0i} = a_{0}, A_{1i} = a_{1}\) for all \(a_{0},a_{1}\)
\end{center}
\begin{itemize}
\item 2. \textbf{Exchangeability}: the conditional probability of receiving every value of treatment, though not decided by the investigators, depends only on the measured covariates
\end{itemize}
\begin{center}
\(A_{0} \ind Y^{a_{0},a_{1}} | L_{0}\) for all \(a_{0},a_{1}\)

\(A_{1} \ind Y^{a_{0},a_{1}} | L_{1},A_{0}=a_{0},L_{0}\) for all \(a_{0},a_{1}\)
\end{center}
\begin{itemize}
\item 3. \textbf{Positivity}: the conditional probability of receiving every value of treatment is greater than zero, i.e., positive
\end{itemize}
\begin{center}
\(f(A_{0} = a_{0} | L_{0} = l_{0}) > 0\) for all \(a_{0},l_{0}\) where \(f(L_{0} = l_{0}) > 0\)

\(f(A_{1} = a_{1} | L_{1} = l_{1}, A_{0} = a_{0}, L_{0} = l_{0}) > 0\) for all \(a_{1},l_{1},a_{0},l_{0}\) where \(f(L_{1} = l_{1}, A_{0} = a_{0}, L_{0} = l_{0}) > 0\)
\end{center}

\subsection{G-formula}
\label{sec:org1f416cd}
This follows the Technical Point 2.3 in \cite{hernanCausalInference2019}.
\begin{align*}
  &~~~\text{By iterative expectation}\\
  E[Y^{a_{0},a_{1}}]
  &= E[E[Y^{a_{0},a_{1}} | L_{0}]]\\
  &~~~\text{By conditional exchangeability: } Y^{a_{0},a_{1}} \ind A_{0} | L_{0}\\
  &= E[E[Y^{a_{0},a_{1}} | A_{0}, L_{0}]]\\
  &~~~\text{By exchangeability, }E[Y^{a_{0},a_{1}} | A_{0}, L_{0}] = E[Y^{a_{0},a_{1}} | A_{0} = a_{0}, L_{0}]\\
  &= E[E[Y^{a_{0},a_{1}} | A_{0} = a_{0}, L_{0}]]\\
  &~~~\text{By iterative expectation}\\
  &= E[E[ E[Y^{a_{0},a_{1}} | L_{1}, A_{0} = a_{0}, L_{0}] | A_{0} = a_{0}, L_{0}]]\\
  &~~~\text{By conditional exchangeability: } Y^{a_{0},a_{1}} \ind A_{1} | L_{1},A_{0},L_{0}\\
  &= E[E[ E[Y^{a_{0},a_{1}} | A_{1}, L_{1}, A_{0} = a_{0}, L_{0}] | A_{0} = a_{0}, L_{0}]]\\
  &~~~\text{By exchangeability, }\\
  &~~~E[Y^{a_{0},a_{1}} | A_{1}, L_{1}, A_{0} = a_{0}, L_{0}] = E[Y^{a_{0},a_{1}} | A_{1} = a_{1}, L_{1}, A_{0} = a_{0}, L_{0}]\\
  &= E[E[ E[Y^{a_{0},a_{1}} | A_{1} = a_{1}, L_{1}, A_{0} = a_{0}, L_{0}] | A_{0} = a_{0}, L_{0}]]\\
  &~~~\text{By consistency}\\
  &= E[E[ E[Y | A_{1} = a_{1}, L_{1}, A_{0} = a_{0}, L_{0}] | A_{0} = a_{0}, L_{0}]]\\
  &~~~\text{Make outer expectations explicit sums}\\
  &= \sum_{l_{0}} \sum_{l_{1}}
    E[Y | A_{1} = a_{1}, L_{1} = l_{1}, A_{0} = a_{0}, L_{0} = l_{0}]\\
  &~~~\times f(L_{1} = l_{1} | A_{0} = a_{0}, L_{0} = l_{0}) f(L_{0} = l_{0})\\
\end{align*}
