iptw_gformula.tex

\subsection{IPTW}
\label{sec:orgdd14d2d}
This follows the Technical Point 2.3 in \cite{hernanCausalInference2019} and an input from \href{https://twitter.com/edwardhkennedy/status/1119305663564472320}{@edwardhkennedy}.
\begin{align*}
  &~~~\text{By iterative expectation}\\
  E\left[Y^{a_{0},a_{1}}\right]
  &= E\left[E\left[Y^{a_{0},a_{1}} | L_{0}\right]\right]\\
  &~~~\text{Insert a carefully-crafted expression that is 1.}\\
  &= E\left[\frac{f(A_{0}=a_{0} | L_{0})}{f(A_{0}=a_{0} | L_{0})} E\left[Y^{a_{0},a_{1}} | L_{0}\right]\right]\\
  &~~~\text{Using probability = expectation of indicator}\\
  &= E\left[\frac{E \left[ I(A_{0}=a_{0}) | L_{0} \right]}{f(A_{0}=a_{0} | L_{0})} E\left[Y^{a_{0},a_{1}} | L_{0}\right]\right]\\
  &~~~\text{By conditional exchangeability: } Y^{a_{0},a_{1}} \ind A_{0} | L_{0}\\
  &~~~\text{Thus, product of expectation = expectation of product}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})} E\left[I(A_{0}=a_{0})Y^{a_{0},a_{1}} | L_{0}\right]\right]\\
  &~~~\text{Law of total expectation}\\
  &= E\left[
    \frac{1}{f(A_{0}=a_{0} | L_{0})} E\left[I(A_{0}=a_{0})Y^{a_{0},a_{1}} | A_{0}=a_{0}, L_{0}\right]
    \right.\\
  &~~~~~~~~+\left.
    \frac{1}{f(A_{0}=a_{0} | L_{0})} E\left[I(A_{0}=a_{0})Y^{a_{0},a_{1}} | A_{0}\ne a_{0}, L_{0}\right]
    \right]\\
  &~~~\text{Indicator in second inner expectation = 0}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})} E\left[I(A_{0}=a_{0})Y^{a_{0},a_{1}} | A_{0} = a_{0}, L_{0}\right]\right]\\
  &~~~\text{By iterative expectation}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})} E\left[E\left[I(A_{0}=a_{0})Y^{a_{0},a_{1}} |L_{1}, A_{0} = a_{0}, L_{0}\right] | A_{0} = a_{0}, L_{0}\right]\right]\\
  &~~~\text{Insert a carefully-crafted expression that is 1.}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})}\times\right.\\
  &~~~~~~~\left.
    E\left[ \frac{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
    E\left[I(A_{0}=a_{0})Y^{a_{0},a_{1}} |L_{1}, A_{0} = a_{0}, L_{0}\right] \bigg| A_{0} = a_{0}, L_{0}\right]\right]\\
  &~~~\text{Using probability = expectation of indicator}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})}\times\right.\\
  &~~~~~~~\left.
    E\left[ \frac{E \left[ I(A_{1}=a_{1}) | L_{1}, A_{0} = a_{0}, L_{0} \right]}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
    E\left[I(A_{0}=a_{0})Y^{a_{0},a_{1}} |L_{1}, A_{0} = a_{0}, L_{0}\right] \bigg| A_{0} = a_{0}, L_{0}\right]\right]\\
  &~~~\text{By conditional exchangeability: } Y^{a_{0},a_{1}} \ind A_{1} | L_{1},A_{0} = a_{0},L_{0}\\
  &~~~\text{Thus, product of expectation = expectation of product}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})}\times\right.\\
  &~~~~~~~\left.
    E\left[ \frac{E\left[I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}} |L_{1}, A_{0} = a_{0}, L_{0}\right]}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
     \bigg| A_{0} = a_{0}, L_{0}\right]\right]\\
  &~~~\text{IPTW at time 1 is a constant given }L_{1}, A_{0} = a_{0}, L_{0}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})}\times\right.\\
  &~~~~~~~\left.
    E\left[
    E\left[\frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}}}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})} \bigg|L_{1}, A_{0} = a_{0}, L_{0}\right]
     \bigg| A_{0} = a_{0}, L_{0}\right]\right]\\
  &~~~\text{Reverse iterative expectation (tower property)}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})}
    E\left[
    \frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}}}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
    \bigg| A_{0} = a_{0}, L_{0}\right]\right]\\
  &~~~\text{Add a second term that is zero by indicator }I(A_{0}=a_{0})\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})}
    E\left[\frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}}}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})} \bigg| A_{0} = a_{0}, L_{0}\right]
    \right.\\
  &~~~~~~~\left. +\frac{1}{f(A_{0}=a_{0} | L_{0})}
  E\left[\frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}}}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})} \bigg| A_{0} \ne a_{0}, L_{0}\right]
\right]\\
  &~~~\text{Thus, we can drop conditioning on $A_{0}$.}\\
  &= E\left[\frac{1}{f(A_{0}=a_{0} | L_{0})}
    E\left[
    \frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}}}{f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
    \bigg| L_{0}\right]\right]\\
  &~~~\text{IPTW at time 0 is a constant given }L_{0}\\
  &= E\left[
    E\left[
    \frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}}}{f(A_{0}=a_{0} | L_{0})f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
    \bigg| L_{0}\right]\right]\\
  &~~~\text{Reverse iterative expectation (tower property)}\\
  &= E\left[
    \frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}}}{f(A_{0}=a_{0} | L_{0})f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
    \right]\\
  &~~~\text{By consistency and presence of indicators}\\
  &~~~I(A_{0}=a_{0})I(A_{1}=a_{1})Y^{a_{0},a_{1}} = I(A_{0}=a_{0})I(A_{1}=a_{1})Y \text{ for all }A_{0},A_{1}\\
  &~~~\text{That is, consistency where $A_{0}=a_{0},A_{1}=a_{1}$, otherwise both sides are zeros.}\\
  &= E\left[
    \frac{I(A_{0}=a_{0})I(A_{1}=a_{1})Y}{f(A_{0}=a_{0} | L_{0})f(A_{1}=a_{1} | L_{1}, A_{0} = a_{0}, L_{0})}
    \right]\\
  &= \text{IPTW mean of $Y$ for group $A_{0} = a_{0}, A_{1} = a_{1}$}\\
\end{align*}

\section{Bibliography Part}
\label{sec:orgd857011}
\subsection{Bibliography}
\label{sec:org1a18317}
\renewcommand{\section}[2]{}

\bibliographystyle{apalike}
\bibliography{../../../../.emacs.d/misc/zotero}
\end{document}